[
    {
        "header": {
          "line1": "I'm a",
          "options": {
            "option1": "Software\nDeveloper",
            "option2": "Career\nChanger",
            "option3": "Student\nat Hive"
          }
        },
        "description": "I started in UX/UI, but one day decided to dive into software development. I love learning by doing, exploring new tools, and building high-quality projects. For me, code is about clarity, joy, and creating something others can build upon"
    },
    {
      "header": "Bio & Experience",
      "description": "I didn’t grow up as a computer geek and never imagined I’d work in tech. My background combines Journalism and Design, and later I transitioned into software development through Hive Helsinki  — a peer-to-peer project-based school, where ownership, curiosity, and collaboration drive progress.  My strongest expertise is in TypeScript and React.",
      "experience": [
        {
          "date": "Sep 2018 - Jun 2021",
          "name": "Bachelor’s in Journalism",
          "description": "Developed strong research and analytical skills, able to gather, verify, and synthesize complex information. Skilled in storytelling and audience-focused communication, adapting style for different platforms and media.Gained understanding of media ethics, information verification, and critical thinking"
        },
        {
          "date": "Nov 2021 - Jun 2022",
          "name": "UX/UI designer at Func.",
          "description": "Built apps and websites in an Agile-like environment using no-code tools. Applied custom CSS and JavaScript to enhance functionality and design. Managed database setup. Handled app store publishing and deployment"
        },
        {
          "date": "Apr 2024 - present",
          "name": "Hive Helsinki 🇫🇮",
          "description": "Developed solo and group projects in C, programmed from scratch or using minimal libraries. Gained foundational knowledge in C++ basics. Completed a web development project, applying front-end and back-end concepts. Participated in a mentorship program, collaborating with a mentor to build Camagru, deepening understanding of front-end development, API integration, state management, and building production-ready projects"
        },
        {
          "date": "Nov 2024 - present",
          "name": "Full Stack Open by University of Helsinki 🇫🇮",
          "description": "Completed comprehensive full-stack web development training focusing on modern JavaScript, React, Redux, NodeJS, and Express. Gained hands-on experience with REST APIs, GraphQL, and database integration (MongoDB, PostgreSQL). Learned state management, component architecture, and hooks in React. Practiced testing, CI/CD pipelines, and deployment of production-ready applications.Explored TypeScript, async programming, and best practices for scalable web apps"
        }
      ]
    },
    {
      "description": "Most of my Hive projects are written in C and aren’t related to frontend development. Here, you’ll mainly find my pet projects, which helped me learn frontend architecture, state management, working with APIs, and building production-ready applications with CI/CD pipelines.",
      "projects": {
        "project1": {
          "img": "/Camagru.png",
          "deployUrl": "ва",
          "githubUrl": "dfs",
          "header": "Camagru | Instagram clone",
          "description": "Built from scratch with secure email-verified authentication, photo uploads/webcam shots, likes, comments, bookmarks, post editing, profile management, QR code sharing, user search, dark mode, and live chat. ",
          "tags": ["Next.js", "TypeScript", "Vanilla CSS", "Playwright", "Jest", "Pet project"]
        },
        "project2": {
          "img": "/Camagru.png",
          "deployUrl": "dfs",
          "githubUrl": "dfs",
          "header": "ft_transendance | ping pong game",
          "description": "Co-developed a website in a 4-person team. I focused on UX/UI and frontend game loop logic, adding accessibility and mobile adaptation for bug-free play on all devices.",
          "tags": ["React", "TypeScript", "Tailwind CSS", "Jest", "Hive project"]
        },
        "project3": {
          "img": "/Camagru.png",
          "deployUrl": "dfs",
          "githubUrl": "dfs",
          "header": "portfolio website",
          "description": "Designed and developed the website with a focus on animations and smooth user experience. Implemented mobile responsiveness, accessibility features for visually impaired users (adjustable font sizes and screen reader support), dark mode, and multi-language support.",
          "tags": ["React", "TypeScript", "Vanilla CSS", "Playwright", "Jest", "Pet project"]
        }
      }
    },
    {
      "header": "Who am I beyond coding\nand studying?",
      "description":"Since it’s hard to sum myself up in only a few words, I thought I’d share some fun facts instead — they’ll give you a better idea of who I am",
      "facts": [
        {
          "fact": "I’m really into Japanese culture. I’ve been to Japan once, but I want to explore it more and more. Maybe one day I’ll even start learning Japanese."
        },
        {
          "fact": "I love taking round mirror selfies. If I see one, there’s no way I can just walk past it."
        },
        {
          "fact": "I’m a huge dog lover. One day I’d love to have my own doodle, but for now I just ask to pet dogs on the street or beg my friends to bring their dogs to events."
        },
        {
          "fact": "I have a collection of funny handmade mugs"
        },
        {
          "fact": "I’m into film photography. Once I brought a disposable camera on a trip, and since then I haven’t been able to stop."
        },
        {
          "fact": "Sometimes I knit or crochet, mostly as a way to relax"
        },
        {
          "fact": "I love rewatching The Office. Every Halloween and Christmas, I make it a tradition to watch the themed episodes. I’m kinda a fan of the show, I even have a LEGO set at home."
        },
        {
          "fact": "My wardrobe is 99% black clothes — I just feel the best in black."
        },
        {
          "fact": "I have a travel ritual: hunting down photo booths in every city and bringing home silly strips of memories"
        },
        {
          "fact": "My short name is Vika which means “problem” in Finnish but I’m not gonna cause any problems =^__^="
        }
      ]
    }
  ]